
function kNumbers(n, k) {
    let numbers = [1]; // Започваме директно с първия елемент 1

    for (let i = 1; i < n; i++) {
        // Вземаме последните k елемента (или колкото има налични до момента)
        // startIndex взема дължината на масива който имаме и отзад напред вземаме числата 'к'
        // ако обаче се окаже, че масива който имаме е по-малко от 'к' за да не стане отрицателно число
        // добавяме командата Math.max(0, ...) която на практика казва числото може да започва от
        // аргумента 0 и да продължи до Infinity това гарантира, че ще имаме винаги положително чсило
        let startIndex = Math.max(0, numbers.length - k);
        // Вземаме масива "numbers", започва от индекс: startIndex и взема
        // всички числа до края на масива след което ги записва в променливата lastKElementi
        // тоест вече имаме последните числа 'к' на брой в масив
        let lastKElementi = numbers.slice(startIndex);

        // Сумираме елементите в под-масива това става като вземем 'а' което е настоящото число
        // 'b' е числото което е подред от масива, 0 е стартовото число. Пример е ако приемем, че
        // масива ни има 1, 2, 3 то ние започваме от 0(което е а но 1вото) + b(което в нашият случа е 1)
        // прави се втори цикъл подобно на while. Втората обиколко е 1 (това е резултата от а + b) към 
        // тях прибавяме следващото число от цикъла което е 2 (или b в случая) ето визуално ясен пример:
        // а + б = 0
        // 0 + 1 = 1
        // 1 + 2 = 3
        // 3 + 3 = 6
        // резултата който се записва в променливата sum = 6 
        let sum = lastKElementi.reduce((a, b) => a + b, 0);
        
        numbers.push(sum);
    }

    return numbers;
}

console.log(kNumbers(6, 3)); 
// Резултат: [1, 1, 2, 4, 7, 13]


kNumbers(6, 3)